name: "WFLW_wo_mp"

# data ------------------------------------

input: "data"
input_shape {
  dim: 1
  dim: 1
  dim: 256
  dim: 256
}

# net -------------------------------------

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1tmp"
}
layer {
  name: "conv1/bn_scale"
  type: "Scale"
  bottom: "conv1tmp"
  top: "conv1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1/bn/relu"
  type: "PReLU"
  bottom: "conv1/bn"
  top: "conv1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_1/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "conv1/bn"
  top: "pre_res_1/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_1/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pre_res_1/branch1/conv1_1x1"
  top: "pre_res_1/branch1/conv1_1x1tmp"
}
layer {
  name: "pre_res_1/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "pre_res_1/branch1/conv1_1x1tmp"
  top: "pre_res_1/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pre_res_1/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "pre_res_1/branch1/conv1_1x1/bn"
  top: "pre_res_1/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_1/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "pre_res_1/branch1/conv1_1x1/bn"
  top: "pre_res_1/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_1/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pre_res_1/branch1/conv2_3x3"
  top: "pre_res_1/branch1/conv2_3x3tmp"
}
layer {
  name: "pre_res_1/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "pre_res_1/branch1/conv2_3x3tmp"
  top: "pre_res_1/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pre_res_1/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "pre_res_1/branch1/conv2_3x3/bn"
  top: "pre_res_1/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_1/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "pre_res_1/branch1/conv2_3x3/bn"
  top: "pre_res_1/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_1/branch2/conv1_1x1"
  type: "Convolution"
  bottom: "conv1/bn"
  top: "pre_res_1/branch2/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_1"
  type: "Eltwise"
  bottom: "pre_res_1/branch2/conv1_1x1"
  bottom: "pre_res_1/branch1/conv3_1x1"
  top: "pre_res_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "pre_res_1"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1_3x3_s2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pool1_3x3_s2"
  top: "pool1_3x3_s2tmp"
}
layer {
  name: "pool1_3x3_s2/bn_scale"
  type: "Scale"
  bottom: "pool1_3x3_s2tmp"
  top: "pool1_3x3_s2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pool1_3x3_s2/bn/relu"
  type: "PReLU"
  bottom: "pool1_3x3_s2/bn"
  top: "pool1_3x3_s2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_2/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "pool1_3x3_s2/bn"
  top: "pre_res_2/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_2/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pre_res_2/branch1/conv1_1x1"
  top: "pre_res_2/branch1/conv1_1x1tmp"
}
layer {
  name: "pre_res_2/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "pre_res_2/branch1/conv1_1x1tmp"
  top: "pre_res_2/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pre_res_2/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "pre_res_2/branch1/conv1_1x1/bn"
  top: "pre_res_2/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_2/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "pre_res_2/branch1/conv1_1x1/bn"
  top: "pre_res_2/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_2/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pre_res_2/branch1/conv2_3x3"
  top: "pre_res_2/branch1/conv2_3x3tmp"
}
layer {
  name: "pre_res_2/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "pre_res_2/branch1/conv2_3x3tmp"
  top: "pre_res_2/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pre_res_2/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "pre_res_2/branch1/conv2_3x3/bn"
  top: "pre_res_2/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "pre_res_2/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "pre_res_2/branch1/conv2_3x3/bn"
  top: "pre_res_2/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "pre_res_2"
  type: "Eltwise"
  bottom: "pre_res_2/branch1/conv3_1x1"
  bottom: "pool1_3x3_s2"
  top: "pre_res_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "pre_res_2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "pre_res_2"
  top: "pre_res_2tmp"
}
layer {
  name: "pre_res_2/bn_scale"
  type: "Scale"
  bottom: "pre_res_2tmp"
  top: "pre_res_2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "pre_res_2/bn/relu"
  type: "PReLU"
  bottom: "pre_res_2/bn"
  top: "pre_res_2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_0/output/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "pre_res_2/bn"
  top: "hourglass_0/output/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_0/output/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_0/output/branch1/conv1_1x1"
  top: "hourglass_0/output/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_0/output/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_0/output/branch1/conv1_1x1tmp"
  top: "hourglass_0/output/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_0/output/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_0/output/branch1/conv1_1x1/bn"
  top: "hourglass_0/output/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_0/output/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_0/output/branch1/conv1_1x1/bn"
  top: "hourglass_0/output/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_0/output/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_0/output/branch1/conv2_3x3"
  top: "hourglass_0/output/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_0/output/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_0/output/branch1/conv2_3x3tmp"
  top: "hourglass_0/output/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_0/output/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_0/output/branch1/conv2_3x3/bn"
  top: "hourglass_0/output/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_0/output/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_0/output/branch1/conv2_3x3/bn"
  top: "hourglass_0/output/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_0/output/branch2/conv1_1x1"
  type: "Convolution"
  bottom: "pre_res_2/bn"
  top: "hourglass_0/output/branch2/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_0/output"
  type: "Eltwise"
  bottom: "hourglass_0/output/branch2/conv1_1x1"
  bottom: "hourglass_0/output/branch1/conv3_1x1"
  top: "hourglass_0/output"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/pool1_2x2_s2"
  type: "Pooling"
  bottom: "hourglass_0/output"
  top: "hourglass_1/pool1_2x2_s2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "hourglass_1/pool1_2x2_s2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/pool1_2x2_s2"
  top: "hourglass_1/pool1_2x2_s2tmp"
}
layer {
  name: "hourglass_1/pool1_2x2_s2/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/pool1_2x2_s2tmp"
  top: "hourglass_1/pool1_2x2_s2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/pool1_2x2_s2/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/pool1_2x2_s2/bn"
  top: "hourglass_1/pool1_2x2_s2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/pool1_2x2_s2/bn"
  top: "hourglass_1/lower_1/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_1/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_1/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_1/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_1/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_1/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_1/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_1/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_1/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_1/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_1/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_1/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_1/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_1/res/branch1/conv3_1x1"
  bottom: "hourglass_1/pool1_2x2_s2"
  top: "hourglass_1/lower_1/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/pool2_2x2_s2"
  type: "Pooling"
  bottom: "hourglass_1/lower_1/res"
  top: "hourglass_1/pool2_2x2_s2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "hourglass_1/pool2_2x2_s2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/pool2_2x2_s2"
  top: "hourglass_1/pool2_2x2_s2tmp"
}
layer {
  name: "hourglass_1/pool2_2x2_s2/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/pool2_2x2_s2tmp"
  top: "hourglass_1/pool2_2x2_s2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/pool2_2x2_s2/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/pool2_2x2_s2/bn"
  top: "hourglass_1/pool2_2x2_s2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/pool2_2x2_s2/bn"
  top: "hourglass_1/lower_2/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_2/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_2/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_2/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_2/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_2/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_2/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_2/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_2/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_2/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_2/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_2/res/branch1/conv3_1x1"
  bottom: "hourglass_1/pool2_2x2_s2"
  top: "hourglass_1/lower_2/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/pool3_2x2_s2"
  type: "Pooling"
  bottom: "hourglass_1/lower_2/res"
  top: "hourglass_1/pool3_2x2_s2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "hourglass_1/pool3_2x2_s2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/pool3_2x2_s2"
  top: "hourglass_1/pool3_2x2_s2tmp"
}
layer {
  name: "hourglass_1/pool3_2x2_s2/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/pool3_2x2_s2tmp"
  top: "hourglass_1/pool3_2x2_s2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/pool3_2x2_s2/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/pool3_2x2_s2/bn"
  top: "hourglass_1/pool3_2x2_s2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/pool3_2x2_s2/bn"
  top: "hourglass_1/lower_3/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_3/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_3/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_3/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_3/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_3/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_3/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_3/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_3/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_3/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_3/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_3/res/branch1/conv3_1x1"
  bottom: "hourglass_1/pool3_2x2_s2"
  top: "hourglass_1/lower_3/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/pool4_2x2_s2"
  type: "Pooling"
  bottom: "hourglass_1/lower_3/res"
  top: "hourglass_1/pool4_2x2_s2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "hourglass_1/pool4_2x2_s2/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/pool4_2x2_s2"
  top: "hourglass_1/pool4_2x2_s2tmp"
}
layer {
  name: "hourglass_1/pool4_2x2_s2/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/pool4_2x2_s2tmp"
  top: "hourglass_1/pool4_2x2_s2/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/pool4_2x2_s2/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/pool4_2x2_s2/bn"
  top: "hourglass_1/pool4_2x2_s2/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/pool4_2x2_s2/bn"
  top: "hourglass_1/lower_4_1/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_4_1/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_1/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_4_1/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_1/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_1/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_4_1/res/branch1/conv3_1x1"
  bottom: "hourglass_1/pool4_2x2_s2"
  top: "hourglass_1/lower_4_1/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_1/res"
  top: "hourglass_1/lower_4_1/restmp"
}
layer {
  name: "hourglass_1/lower_4_1/res/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_1/restmp"
  top: "hourglass_1/lower_4_1/res/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_1/res/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_1/res/bn"
  top: "hourglass_1/lower_4_1/res/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_1/res/bn"
  top: "hourglass_1/lower_4_2/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_4_2/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_2/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_4_2/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_2/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_2/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_4_2/res/branch1/conv3_1x1"
  bottom: "hourglass_1/lower_4_1/res"
  top: "hourglass_1/lower_4_2/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_2/res"
  top: "hourglass_1/lower_4_2/restmp"
}
layer {
  name: "hourglass_1/lower_4_2/res/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_2/restmp"
  top: "hourglass_1/lower_4_2/res/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_2/res/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_2/res/bn"
  top: "hourglass_1/lower_4_2/res/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_2/res/bn"
  top: "hourglass_1/lower_4_3/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv1_1x1"
  top: "hourglass_1/lower_4_3/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/lower_4_3/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv2_3x3"
  top: "hourglass_1/lower_4_3/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/lower_4_3/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/lower_4_3/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/lower_4_3/res"
  type: "Eltwise"
  bottom: "hourglass_1/lower_4_3/res/branch1/conv3_1x1"
  bottom: "hourglass_1/lower_4_2/res"
  top: "hourglass_1/lower_4_3/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_4/interp"
  type: "Interp"
  bottom: "hourglass_1/lower_4_3/res"
  bottom: "hourglass_1/lower_3/res"
  top: "hourglass_1/upper_4/interp"
}
layer {
  name: "hourglass_1/lower_3/res/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_3/res"
  top: "hourglass_1/lower_3/restmp"
}
layer {
  name: "hourglass_1/lower_3/res/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_3/restmp"
  top: "hourglass_1/lower_3/res/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_3/res/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_3/res/bn"
  top: "hourglass_1/lower_3/res/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_3/res/bn"
  top: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3"
  top: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_4/skip/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_4/skip/res"
  type: "Eltwise"
  bottom: "hourglass_1/upper_4/skip/res/branch1/conv3_1x1"
  bottom: "hourglass_1/lower_3/res"
  top: "hourglass_1/upper_4/skip/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_4/output"
  type: "Eltwise"
  bottom: "hourglass_1/upper_4/skip/res"
  bottom: "hourglass_1/upper_4/interp"
  top: "hourglass_1/upper_4/output"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_4/output/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_4/output"
  top: "hourglass_1/upper_4/outputtmp"
}
layer {
  name: "hourglass_1/upper_4/output/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_4/outputtmp"
  top: "hourglass_1/upper_4/output/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_4/output/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_4/output/bn"
  top: "hourglass_1/upper_4/output/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_4/output/bn"
  top: "hourglass_1/upper_3/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_3/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_3/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_3/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/upper_3/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_3/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_3/res/branch1/conv2_3x3"
  top: "hourglass_1/upper_3/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_3/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_3/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_3/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/res"
  type: "Eltwise"
  bottom: "hourglass_1/upper_3/res/branch1/conv3_1x1"
  bottom: "hourglass_1/upper_4/output"
  top: "hourglass_1/upper_3/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_3/interp"
  type: "Interp"
  bottom: "hourglass_1/upper_3/res"
  bottom: "hourglass_1/lower_2/res"
  top: "hourglass_1/upper_3/interp"
}
layer {
  name: "hourglass_1/lower_2/res/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_2/res"
  top: "hourglass_1/lower_2/restmp"
}
layer {
  name: "hourglass_1/lower_2/res/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_2/restmp"
  top: "hourglass_1/lower_2/res/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_2/res/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_2/res/bn"
  top: "hourglass_1/lower_2/res/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_2/res/bn"
  top: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3"
  top: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_3/skip/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_3/skip/res"
  type: "Eltwise"
  bottom: "hourglass_1/upper_3/skip/res/branch1/conv3_1x1"
  bottom: "hourglass_1/lower_2/res"
  top: "hourglass_1/upper_3/skip/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_3/output"
  type: "Eltwise"
  bottom: "hourglass_1/upper_3/skip/res"
  bottom: "hourglass_1/upper_3/interp"
  top: "hourglass_1/upper_3/output"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_3/output/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_3/output"
  top: "hourglass_1/upper_3/outputtmp"
}
layer {
  name: "hourglass_1/upper_3/output/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_3/outputtmp"
  top: "hourglass_1/upper_3/output/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_3/output/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_3/output/bn"
  top: "hourglass_1/upper_3/output/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_3/output/bn"
  top: "hourglass_1/upper_2/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_2/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_2/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_2/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/upper_2/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_2/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_2/res/branch1/conv2_3x3"
  top: "hourglass_1/upper_2/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_2/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_2/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_2/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/res"
  type: "Eltwise"
  bottom: "hourglass_1/upper_2/res/branch1/conv3_1x1"
  bottom: "hourglass_1/upper_3/output"
  top: "hourglass_1/upper_2/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_2/interp"
  type: "Interp"
  bottom: "hourglass_1/upper_2/res"
  bottom: "hourglass_1/lower_1/res"
  top: "hourglass_1/upper_2/interp"
}
layer {
  name: "hourglass_1/lower_1/res/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/lower_1/res"
  top: "hourglass_1/lower_1/restmp"
}
layer {
  name: "hourglass_1/lower_1/res/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/lower_1/restmp"
  top: "hourglass_1/lower_1/res/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/lower_1/res/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/lower_1/res/bn"
  top: "hourglass_1/lower_1/res/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/lower_1/res/bn"
  top: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3"
  type: "Convolution"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv1_1x1/bn"
  top: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3"
  top: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3tmp"
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3tmp"
  top: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res/branch1/conv3_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv2_3x3/bn"
  top: "hourglass_1/upper_2/skip/res/branch1/conv3_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_2/skip/res"
  type: "Eltwise"
  bottom: "hourglass_1/upper_2/skip/res/branch1/conv3_1x1"
  bottom: "hourglass_1/lower_1/res"
  top: "hourglass_1/upper_2/skip/res"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_2/output"
  type: "Eltwise"
  bottom: "hourglass_1/upper_2/skip/res"
  bottom: "hourglass_1/upper_2/interp"
  top: "hourglass_1/upper_2/output"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "hourglass_1/upper_2/output/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_2/output"
  top: "hourglass_1/upper_2/outputtmp"
}
layer {
  name: "hourglass_1/upper_2/output/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_2/outputtmp"
  top: "hourglass_1/upper_2/output/bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "hourglass_1/upper_2/output/bn/relu"
  type: "PReLU"
  bottom: "hourglass_1/upper_2/output/bn"
  top: "hourglass_1/upper_2/output/bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  name: "hourglass_1/upper_1/res/branch1/conv1_1x1"
  type: "Convolution"
  bottom: "hourglass_1/upper_2/output/bn"
  top: "hourglass_1/upper_1/res/branch1/conv1_1x1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "hourglass_1/upper_1/res/branch1/conv1_1x1/bn_batchmorn"
  type: "BatchNorm"
  bottom: "hourglass_1/upper_1/res/branch1/conv1_1x1"
  top: "hourglass_1/upper_1/res/branch1/conv1_1x1tmp"
}
layer {
  name: "hourglass_1/upper_1/res/branch1/conv1_1x1/bn_scale"
  type: "Scale"
  bottom: "hourglass_1/upper_1/res/branch1/conv1_1x1tmp"
  top: "hourglass_1/upper_1/res/branch1/conv1_1x1/bn"
  scale_param {
